# DimDisplayEq Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimDisplayEq Property
ParameterTypeId Class See Also
---
"Equality Display"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimDisplayEq { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimDisplayEq As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimDisplayEq {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace